Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-IT/tmx_teil_2.tmx
Source language: en
Languages: it

source: Alternating pressure mattresses for medical use
it: Materassi a pressione alternata per uso medico

source: Respiratory helmets for artificial respiration
it: Caschi respiratori per la respirazione artificiale

source: Respiratory monitors [medical]
it: Monitor della respirazione [medici]

source: Sensor apparatus for medical use in diagnosis
it: Apparecchi sensori per uso medico nella diagnosi

source: Patient examination tables
it: Tavoli per visita di pazienti

source: Elastic compression bandages for surgical purposes
it: Fasciature elastiche a compressione per uso chirurgico

source: Elasticated bandages incorporating copper
it: Fasciature elasticizzate contenenti rame

source: Elasticated supports for the ankle
it: Supporti elastici per la caviglia

source: Mesh nerve connecting tubes for medical use
it: Tubi di connessione nervosa a rete per uso medico

source: Nail pinches for medical use
it: Pinzette per unghie per uso medico

source: Fibrescopes for medical use
it: Fibroscopi per uso medico

source: Goniometers for orthopaedic use
it: Goniometri per uso ortopedico

source: Electrocardiograph monitors
it: Monitor per elettrocardiografi

source: Ligating clip applicators for medical use
it: Applicatori di graffette di sutura per uso medico

source: Ligating clips for medical use
it: Graffette di sutura per uso medico

source: Light sources for medical use
it: Sorgenti luminose per uso medico

source: Liquid chromatography injectors for medical use
it: Iniettori per la cromatografia dei liquidi per uso medico

source: Liquid chromatography instruments for medical use
it: Strumenti per la cromatografia dei liquidi per uso medico

source: Medical pressure chambers
it: Camere mediche a pressione

source: Endodontic devices
it: Strumenti endodontici

source: Endoscopes for diagnostic use
it: Endoscopi per uso diagnostico

source: Epidural analgesia apparatus for medical use
it: Apparecchi per analgesia epidurale per uso medico

source: Epidural analgesia apparatus for surgical use
it: Apparecchi per analgesia epidurale per uso chirurgico

source: Medical apparatus for the relief of pain
it: Apparecchi medici per alleviare il dolore

source: Bags [fitted] for use by surgeons
it: Borse [accessoriate] per chirurghi

source: Insole-shells [orthopaedic]
it: Plantari [ortopedici]

source: Instruments for cardiac stimulation
it: Strumenti per la stimolazione cardiaca

source: Laser light treatment instruments for medical use
it: Strumenti per trattamenti laser per uso medico

source: Mouth guards for medical purposes
it: Mascherine per uso medico

source: Surgical implants comprised of artificial materials
it: Impianti chirugici composti da materiale artificiale

source: Humidifying apparatus for medical use
it: Macchine umidificatrici per uso medico

source: Laser pointers for medical use
it: Puntatori laser per uso medico

source: Aural prostheses
it: Protesi auricolari

source: Medical therapy instruments
it: Strumenti medici per terapie

source: Membrane test plates for use in medical diagnostics
it: Piastre per test a membrana per uso medico diagnostico

source: Telemetry devices for medical applications
it: Dispositivi di telemetria per applicazioni mediche

source: Apparatus for analysing alcohol in breath fluids [for medical use]
it: Apparecchi per l'analisi del tasso alcolico nei liquidi espirati [per uso medico]

source: Cardiac probes
it: Sonde cardiache

source: Cardioversion and/or defibrillator leads
it: Conduttori per cardioversione e/o defibrillatori

source: Electrophoresis apparatus
it: Apparecchi per elettroforesi

source: Temperature sensitive testing instruments for medical use
it: Strumenti termosensibili per test per uso medico

source: Pressure garments for medical treatment
it: Indumenti a compressione per trattamenti medici

source: Pressurised suits for medical use
it: Completi pressurizzati per uso medico

source: Artificial limbs
it: Arti artificiali

source: Prostheses constructed in high strength porcelain affixed to the enamel structure
it: Protesi costruite in porcellana ad alta resistenza fissate alla struttura dello smalto

source: Compression panty hose
it: Calzetteria a compressione

source: Contoured inflated pads for patients
it: Materassini contornati gonfiati per pazienti

source: Medical drainage bags for collection of biliary
it: Sacche di drenaggio mediche per raccolta biliare

source: Optometric instruments
it: Strumenti optometrici

source: Orthopaedic instruments
it: Strumenti ortopedici

source: Orthopaedic compression supports
it: Supporti ortopedici a compressione

source: Protective bonnets for the hair for wear by veterinary practitioners
it: Cuffie protettive per i capelli indossate da personale veterinario

source: Protective breathing masks for surgical applications
it: Maschere respiratorie protettive per applicazioni chirurgiche

source: Protective breathing masks made of non-woven materials for surgical applications
it: Maschere respiratorie protettive in materiali non tessuti per applicazioni chirurgiche

source: Protective face masks for medical use
it: Maschere protettive per il viso per uso medico

source: Protective gloves for use by surgeons during operations
it: Guanti di protezione per chirurghi, per uso durante operazioni

source: Autoclaves for medical use
it: Autoclavi per uso medico

source: Arch supports for flat feet
it: Plantari per piedi piatti

source: Armchairs especially made for surgical purposes
it: Poltrone speciali per uso chirurgico

source: Artificial cranial components
it: Componenti cranici artificiali

source: Artificial heart-lung machines
it: Macchine artificiali cuore-polmoni

source: Pillows for orthopedic use
it: Guanciali per uso ortopedico

source: Pillows for therapeutic use
it: Guanciali per uso terapeutico

source: Pipes for veterinary applications
it: Tubi per applicazioni veterinarie

source: Physical exercise apparatus for medical purposes
it: Apparecchi per esercizi fisici per scopi medici

source: Electrodes for external defibrillators
it: Elettrodi per defibrillatori esterni

source: Medical apparatus for facilitating the inhalation of pharmaceutical preparations
it: Apparecchi medici per agevolare l'inalazione di preparati farmaceutici

source: Voice simulating prostheses
it: Protesi di simulazione vocale

source: Cushioning devices for medical use
it: Dispositivi imbottiti per uso medico

source: Cystomeric instruments
it: Apparecchi cistomerici

source: Surgical instruments
it: Strumenti chirurgici

source: Chromatographic instruments for medical use
it: Apparecchi per cromatografia per uso medico

source: Boxes adapted for medical waste products
it: Scatole per prodotti medici di scarto

source: Dentists' armchairs
it: Poltrone per dentisti

source: Artificial lenses for implantation in the eye
it: Cristallini artificiali da impiantare nell'occhio

source: Artificial parts for teeth
it: Parti artificiali di denti

source: Artificial sponges for medical purposes
it: Spugne artificiali per uso medico

source: Apparatus for the treatment of cancer
it: Apparecchi per la terapia del cancro

source: Apparatus for the treatment of cellulite
it: Apparecchi per il trattamento della cellulite

source: Diagnostic apparatus for pregnancy testing
it: Apparecchiature diagnostiche per test di gravidanza

source: Therapeutic garments for people
it: Indumenti terapeutici per persone

source: Thermal electric compresses for medical use
it: Compresse termiche elettriche per uso medico

source: Trace material analyzers for medical use in diagnosis
it: Analizzatori di oligoelementi per la diagnosi medica

source: Transplant protheses for use in surgery
it: Protesi da trapianto per uso nella chirurgia

source: Tubes for perfusion
it: Tubi per perfusione

source: Quartz lamps for medical purposes
it: Lampade al quarzo per uso medico

source: Veterinary apparatus and instruments
it: Apparecchi e strumenti veterinari

source: Weights for physical exercise [adapted for medical use]
it: Pesi per l'esercizio fisico [adatti per uso medico]

source: X-ray analyzers for medical use
it: Analizzatori a raggi X per uso medico

source: Apparatus for carrying-out diagnostic tests for medical purposes
it: Apparecchi per l'effettuazione di test diagnostici per uso medico

source: Inhalers for the evaporation of para-medical substances
it: Inalatori per l'evaporazione di sostanze paramediche

source: Penile sheaths
it: Guaine per pene

source: Permanent magnets for therapeutic use
it: Magneti permanenti per uso terapeutico

source: Physical exercise articles for physical training [for medical purposes]
it: Articoli per l'esercizio fisico da allenamento [per uso medico]

source: Surgical instruments for use in orthopedic surgery
it: Strumenti chirurgici per la chirurgia ortopedica

source: Suction apparatus for medical use
it: Apparecchi di aspirazione per uso medico

source: Implant materials [prosthesis] for use in surgery
it: Materiali per impianti [protesi] per uso chirurgico

source: Implantable cardiac pulse generators
it: Generatori di impulsi cardiaci impiantabili

source: Implants [prosthesis] for use in facial surgery
it: Impianti [protesi] per chirurgia facciale

source: Pliers for dental use
it: Pinze per uso dentistico

source: Pneumatically operated medical instruments
it: Strumenti medici ad azionamento pneumatico

source: Oxygen electrodes for medical use
it: Elettrodi ad ossigeno per uso medico

source: Padded cushions for medical purposes
it: Cuscini imbottiti per uso medico

source: Hypogastric belts
it: Cinture ipogastriche

source: Gloves for massage
it: Guanti per massaggi

source: Cardiopulmonary perfusion apparatus
it: Apparecchi da perfusione cardio-polmonare

source: Manual massage instruments
it: Strumenti manuali per massaggi

source: Mastectomy brassieres
it: Reggiseni da mastectomia

source: Tubular elastic bandages for supporting limbs
it: Fasciature elastiche tubolari per il supporto di arti

source: Ultrasonic cleaning instruments for surgical use
it: Strumenti per la pulizia ad ultrasuoni per uso chirurgico

source: Ultrasonic cleaning instruments for veterinary use
it: Strumenti per la pulizia ad ultrasuoni per uso veterinario

source: Ultrasonic diagnostic instruments for dental use
it: Apparecchi diagnostici ad ultrasuoni per uso dentistico

source: Vaginal syringes
it: Siringhe vaginali

source: Detecting instruments for veterinary use
it: Strumenti di rilevazione per uso veterinario

source: Hammers for medical or surgical use
it: Martelli per uso medico o chirurgico

source: Hard elastic sutures
it: Suture elastiche rigide

source: Radio cardiographic apparatus for medical purposes
it: Apparecchi radiocardiografici per uso medico

source: Radioisotope apparatus for medical use
it: Apparecchi a radio-isotopi per uso medico

source: Staplers for medical purposes
it: Punti metallici per uso medico

source: Pads for seats for wheelchairs [for medical use]
it: Imbottiture per sedili per sedie a rotelle [per uso medico]

source: Casting splints
it: Stecche per gesso

source: Centro-medullary nails for femur
it: Chiodi centromidollari per il femore

source: Mallets for medical use
it: Mazzuole per uso medico

source: Mallets for surgical use
it: Mazzuole per uso chirurgico

source: Clinical thermometers
it: Termometri per la febbre

source: Forceps elevators
it: Elevatori per forcipi

source: Forceps for dental technical purposes
it: Forcipi per uso odontotecnico

source: Sheets made of rubber for incontinence
it: Lenzuola in gomma per incontinenza

source: Electric blankets [bed] for medical use
it: Termocoperte [da letto] per uso medico

source: Femoral nails
it: Chiodi femorali

source: Biodegradable implants
it: Impianti biodegradabili

source: Blood collection tubes for medical use
it: Tubi per raccolta del sangue per uso medico

source: Instruments for treating snake bites
it: Strumenti per la cura di morsi di serpente

source: Non-elastic bandages [supportive]
it: Fasciature non elastiche [di supporto]

source: Measuring devices for medical use
it: Dispositivi di misurazione per uso medico

source: Measuring instruments adapted for medical use
it: Strumenti di misurazione adatti all'uso medico

source: Mechanical valves for implantation in human hearts
it: Valvole meccaniche da impiantare nel cuore umano

source: Medical instruments
it: Strumenti medici

source: Medical instruments for the removal of warts by freezing
it: Strumenti medici per la rimozione di verruche mediante congelamento

source: Digital thermometers for medical purposes
it: Termometri digitali per uso medico

source: Examination fingercots
it: Copridita per esame

source: Retentive belts for use by colostomy patients
it: Cinture di trattenimento per pazienti con colostomia

source: Electromedical diagnostic instruments
it: Strumenti diagnostici elettromedicali

source: Electronic analyzers for medical purposes
it: Analizzatori elettronici per uso medico

source: Interdental immobilization instruments
it: Strumenti di immobilizzazione interdentali

source: Intra-corneal implants
it: Impianti intracorneali

source: Intramedullary plugs
it: Tappi endomidollari

source: Intraocular lenses for surgical implantation
it: Lenti intraoculari per impianti chirurgici

source: Lasers incorporating optical fibres for medical use
it: Laser comprendenti fibre ottiche per uso medico

source: Bags for surgical use in collecting urine
it: Sacche per uso chirurgico per la raccolta di urina

source: Cervical collars
it: Collarini cervicali

source: Dental picks, other than for personal use
it: Ablatori, non per uso personale

source: Dental spectrocolorimeters
it: Spettrocolorimetri dentari

source: Ureteral stents being surgical support
it: Stent uretrali ovvero supporti chirurgici

source: Surgical probes
it: Sonde chirurgiche

source: Surgical tubing for wound drainage
it: Tubi chirurgici per il drenaggio di ferite

source: Suspensory bandages for use in athletics
it: Fasciature di sospensione per l'atletica

source: Prostheses for implantation into the jaw bone
it: Protesi per impianto nell'osso della mascella

source: Prosthetic sleeves for limbs
it: Rivestimenti per protesi di arti

source: Prosthetic suspension sleeves for limbs
it: Guaine di sospensione per protesi di membra

source: Automatic vaccination apparatus
it: Apparecchi automatici di vaccinazione

source: High frequency electromagnetic therapy apparatus
it: Apparecchi terapeutici elettromagnetici ad alta frequenza

source: Implants consisting of artificial materials
it: Impianti costituiti da materiali artificiali

source: Electric scalpels [for surgical purposes]
it: Bisturi elettrici [per uso chirurgico]

source: Ophthalmological instruments
it: Strumenti oftalmologici

source: Air mattresses for infants [for medical purposes]
it: Materassi ad aria per bambini [per uso medico]

source: Anaesthesia screens
it: Schermi per anestesia

source: Spermicidal condoms
it: Preservativi spermicidi

source: Splinting materials for surgical use
it: Materiale per stecche per uso chirurgico

source: Orthopaedic foot cushions
it: Cuscini per piedi ortopedici

source: Receptacles for receiving surgical instruments
it: Recipienti per la ricezione di strumenti chirurgici

source: Respiratory masks for artificial respiration
it: Maschere respiratorie per la respirazione artificiale

source: Patient examination gowns
it: Camici da esame per pazienti

source: Elasticated bandages incorporating copper compounds
it: Fasciature elasticizzate contenenti composti di rame

source: Filters for temporary placement within veins
it: Filtri per collocazione temporanea nella vene

source: Gloves for use during operations
it: Guanti per utilizzo durante operazioni

source: Grafts for surgical use
it: Innesti per uso chirurgico

source: Electrical utensils for use by dentists in the care of the teeth
it: Utensili elettrici per dentisti per la cura dei denti

source: Electrocardiograph instruments
it: Apparecchiature elettrocardiografiche

source: Light sources for electronic endoscopes for medical purposes
it: Fonti luminose per endoscopi elettronici per uso medico

source: Face masks for medical use for anti bacterial protection
it: Maschere per il viso per uso medico con proprietà antibatteriche

source: Medical pulse pressure transducers
it: Trasduttori medici di pressione ad impulsi

source: Electrotherapy instruments for slimming treatments
it: Strumenti per elettroterapia per trattamenti dimagranti

source: Endoscopes for surgical use
it: Endoscopi per uso chirurgico

source: Endoscopic occlusion balloons
it: Palloncini di occlusione endoscopici

source: Vascular access ports for medical use
it: Porte di accesso vascolare per uso medico

source: Medical apparatus for renal dialysis
it: Apparecchi medici per la dialisi renale

source: Bandages for supporting the human body
it: Fasciature di supporto per il corpo umano

source: Biliary drainage catheters
it: Cateteri di drenaggio biliare

source: Stirrups for use with medical examination tables
it: Staffe da utilizzare con tavoli per esami medici

source: Surgical examination drapes
it: Teli chirurgici da esame

source: Instruments for intraluminar sclerosation of varicose veins
it: Strumenti per la sclerosazione intraluminare di vene varicose

source: Lamps for producing polarised light for medical use
it: Lampade per la produzione di luce polarizzata per uso medico

source: Laser cutting tools for medical use
it: Utensili da taglio laser per uso medico

source: Holders for x-ray films for use in the mouth
it: Supporti per pellicole radiografiche per uso orale

source: Automatic analyzers for medical diagnosis
it: Analizzatori automatici per la diagnosi medica

source: Testing apparatus for medical purposes
it: Apparecchi per l'analisi per uso medico

source: Surgical amputaters
it: Amputatori chirurgici

source: Templates for orthopedic purposes
it: Sagome per uso ortopedico

source: Pads [pouches] for preventing pressure sores on patient bodies
it: Cuscinetti per impedire la formazione di croste

source: Apparatus (Medical -) for extracting oxygen from the atmosphere
it: Apparecchi (medici) per estrarre ossigeno dall'atmosfera

source: Containers for transporting samples containing living human cells
it: Recipienti per il trasporto di provini contenenti cellule umane vive

source: Corsets for therapeutic use
it: Busti per uso terapeutico

source: Inserts for breathing masks for surgical use
it: Inserti per maschere respiratorie per uso chirurgico

source: Orthopaedic footwear
it: Calzature ortopediche

source: Artificial teeth
it: Denti artificiali

source: Surgical apparatus and instruments
it: Apparecchi e strumenti chirurgici

source: Electronic medical instruments
it: Strumenti medici elettronici

source: Electronic monitoring instruments for medical use
it: Apparecchi di monitoraggio elettronici per uso medico

source: Electrophysiology electrodes
it: Elettrodi per elettrofisiologia

source: Carbon dioxide indicators for medical use
it: Indicatori di biossido di carbonio per uso medico

source: Medical examination lamps
it: Lampade per esami medici

source: Medical gowns
it: Camici medici

source: Masks for use by medical personnel
it: Maschere utilizzate dal personale medico

source: Teething chains for relieving teething pain
it: Catenelle per alleviare il dolore della dentizione

source: Temperature monitors for medical use
it: Monitor della temperatura per uso medico

source: Apparatus for the treatment of leg ulcers
it: Apparecchi per il trattamento di ulcere alle gambe

source: Powered respirators for artificial respiration
it: Respiratori elettrici per la respirazione artificiale

source: Optical instruments for medical endoscopy
it: Strumenti ottici per endoscopia medica

source: Lag screws in the nature of orthopaedic surgical instruments
it: Viti grafitate, ovvero strumenti chirurgici ortopedici

source: Oxygen inhalers for medical purposes sold empty
it: Inalatori di ossigeno per uso medico venduti vuoti

source: Apparatus for non-invasive surgery
it: Apparecchi per la chirurgia non invasiva

source: Apparatus for the application of laser radiation for dental purposes
it: Apparecchi per l'applicazione di radiazione laser a scopo dentistico

source: Throughflow operated centrifuges filters for medical use
it: Filtri a centrifuga a flusso passante per uso medico

source: Tooth polishing appliances for use by dentists
it: Apparecchi per dentisti per levigare i denti

source: Hospital beds for use by burn patients
it: Letti ospedalieri per pazienti ustionati

source: Arch cushions [orthopaedic]
it: Cuscini ad arco [ortopedici]

source: Arch supports for orthopaedic boots
it: Plantari per scarponi ortopedici

source: Artificial cartilage made from synthetic materials
it: Cartilagine artificiale in materiale sintetico

source: Pipes for surgical applications
it: Tubi per applicazioni chirurgiche

source: Pipetting instruments for medical use
it: Apparecchi a pipetta per uso medico

source: Vacuum probes for medical use
it: Sonde a vuoto per uso medico

source: Ventilator breathing apparatus for artificial respiration
it: Apparecchi ventilatori per la respirazione artificiale

source: Vessels for histological purposes
it: Recipienti per uso istologico

source: Implants for osteosynthesis
it: Impianti per osteosintesi

source: Air mattresses for medical purposes
it: Materassi ad aria, per uso medico

source: Cytofluorometric apparatus
it: Apparecchi citofluorometrici

source: Support bandages for medical purposes
it: Fasciature di supporto per uso medico

source: Mirrors for dentists
it: Specchietti per dentisti

source: Radiology screens for medical purposes
it: Schermi radiologici per uso medico

source: Braces for application to the human body
it: Supporti da applicare al corpo umano

source: Breast pumps for use by nursing mothers
it: Tiralatte per madri in allattamento

source: Oral irrigators
it: Irrigatori orali

source: Incontinence bed pads
it: Traverse per incontinenza

source: Artificial orthopaedic implants
it: Impianti ortopedici artificiali

source: Apparatus for the diagnosis of neurological diseases
it: Apparecchi per la diagnosi di malattie neurologiche

source: Apparatus for the prevention of pressure sores
it: Apparecchi per impedire la formazione di piaghe

source: Apparatus for the treatment of disease of the prostate
it: Apparecchi per la cura di malattie della prostata

source: Apparatus for veterinary purposes
it: Apparecchi per uso veterinario

source: Artificial eyes
it: Occhi artificiali

source: Protective visors for medical use
it: Visiere protettive per uso medico

source: Tractions [medical apparatus]
it: Trazioni [apparecchi medici]

source: Transcutaneous electrical muscle stimulators
it: Stimolatori elettrici transcutanei dei muscoli

source: Transcutaneous electrical nerve stimulation electrodes
it: Elettrodi transcutanei di stimolazione elettrica dei nervi

source: Transcutaneous electrical nerve stimulators
it: Stimolatori elettrici transcutanei dei nervi

source: Urethral syringes
it: Siringhe uretrali

source: Thermo-electric compresses [surgery]
it: Compresse termoelettriche [chirurgia]

source: Compressors [surgical]
it: Compressori [chirurgia]

source: Cases fitted for medical instruments
it: Valigette speciali per strumenti medici

source: Wrist braces for medical use
it: Supporti per i polsi per uso medico

source: Apparatus for analysing measured physical signals
it: Apparecchi per analizzare i segnali fisici misurati

source: Apparatus for destroying hypodermic needles [specifically adapted for medical use]
it: Apparecchi per la distruzione di aghi ipodermici [specificamente per uso medico]
